posts/elixir-otp-releases.org
#+TITLE: Releasing Elixir/OTP applications to the World
#+DESCRIPTION: The perils of releasing OTP applications in the wild
#+TAGS: Erlang/OTP
#+TAGS: Elixir
#+TAGS: Phoenix
#+TAGS: Docker
#+TAGS: How-to
#+TAGS: Tips and Tricks
#+DATE: 2016-05-27
#+SLUG: elixir-otp-releases
#+LINK: erlang-docs-systools http://erlang.org/doc/man/systools.html
#+LINK: erlang-docs-reltool http://erlang.org/doc/man/reltool.html
#+LINK: rebar https://github.com/erlang/rebar3/releases
#+LINK: relx https://github.com/erlware/relx
#+LINK: erlang-docs-release http://erlang.org/doc/design_principles/release_structure.html
#+LINK: exrm https://github.com/bitwalker/exrm
#+LINK: wiki-autotools https://en.wikipedia.org/wiki/GNU_Build_System
#+LINK: phoenix-docs-releases http://www.phoenixframework.org/docs/advanced-deployment
#+LINK: erlang-solutions-homepage https://erlang-solutions.com
#+LINK: alpine-linux http://alpinelinux.org
#+LINK: hex-comeonin https://hex.pm/packages/comeonin
#+LINK: docker https://docker.com
#+LINK: docker-hub https://hub.docker.com/explore/
#+LINK: kb-docker-elixir-centos https://github.com/kennyballou/docker-elixir-centos
#+LINK: gnu-automake-crosscompile https://www.gnu.org/software/automake/manual/html_node/Cross_002dCompilation

#+BEGIN_PREVIEW
Developing Elixir/OTP applications is an enlightening, mind-boggling, and
ultimately enjoyable experience.  There are so many features of the language
that change the very way we as developers think about concurrency and program
structure.  From writing pure functional code, to using message passing to
coordinate complex systems, it is one of the best languages for the SMP
revolution that has been slowly boiling under our feet.
#+END_PREVIEW

However, /releasing/ Elixir and OTP applications is an entirely different and
seemingly seldom discussed topic.

The distribution tool chain of Erlang and OTP is a complicated one, There's
[[erlang-docs-systools][~systools~]], [[erlang-docs-reltool][~reltool~]],
[[rebar][~rebar(?3)~]], and [[relx][~relx~]] just to name a few that all
ultimately help in creating an Erlang/OTP [[erlang-docs-release]["release"]].
Similar to ~rebar3~, [[exrm][~exrm~]] takes the high-level abstraction approach
to combining ~reltool~ and ~relx~ into a single tool chain for creating
releases of Elixir projects.  Of course, we can also borrow from the collection
of [[wiki-autotools][autotools]].

There are plenty of articles and posts discussing how and why to use ~exrm~.  I
feel many of them, however, fail to /truly/ discuss /how/ to do this
effectively.  Most will mention the surface of the issue, but never give the
issue any real attention.  As any developer that wants to eventually /ship/
code, this is entirely too frustrating to leave alone.

There are "ways" of deploying OTP code relatively simply, however, these
methods generally avoid good practice of continuous integration/continuous
deployment, e.g., "build the OTP application /on/ the target system" or simply
use ~mix run~, etc.

I cannot speak for everyone, but my general goal is to /not/ have such a manual
step in my release pipeline, let alone having a possibly full autotool chain
and Erlang/Elixir stack on the production system is slightly unnerving for it's
own set of reasons.

** Problem
:PROPERTIES:
:ID:       a5bb175a-373c-45ee-b686-1a6fd9254859
:END:

Here are some selected quotes; I'm not trying to pick on anyone in particular
or the community at large, but I'm trying to show a representation of why this
very topic is an issue in the first place.

#+BEGIN_QUOTE
We need to be sure that the architectures for both our build and hosting
environments are the same, e.g. 64-bit Linux -> 64-bit Linux.  If the
architectures don't match, our application might not run when deployed.
Using a virtual machine that mirrors our hosting environment as our build
environment is an easy way to avoid that problem.
[[phoenix-docs-releases][Phoenix Exrm Releases]].
#+END_QUOTE

And another, similar quote:

#+BEGIN_QUOTE
One important thing to note, however: /you must use the same architecture for
building your release that the release is getting deployed to./ If your
development machine is OS X and you're deploying to a Linux server, you need
a Linux machine to build your exrm release or it isn't going to work, or you
can just build on the same server you're going to be running everything on.
[[erlang-solutions-homepage][Brandon Richey]].
#+END_QUOTE

Unfortunately, these miss a lot of the more subtle issues, dependency hell is
real, and we're about to really dive into it.

There are a few examples where "same architecture" isn't enough, and this is
where we will spend the majority of our time.

For these examples, we will assume our host machine is running GNU/Linux,
specifically Arch Linux, and our target machine is running CentOS 7.2.  Both
machines are running the ~AMD64~ instruction sets, the architectures are the
/same/.

*** Shared Objects
:PROPERTIES:
:ID:       93561071-f3ac-4bbc-a24d-4977bd78a317
:END:

Let's start with the most simplistic issue, different versions of shared
objects.

Arch Linux is a rolling release distribution that is generally /right/ on the
bleeding edge of packages, upstream is usually the development sources
themselves.  When ~ncurses~ moves version 6, Arch isn't far behind in putting
it in the stable package repository (and rebuilding a number of packages that
depend on ~ncurses~).  CentOS, on the other hand, is not so aggressive.
Therefore, when using the default ~relx~ configuration with ~exrm~, the Erlang
runtime system (ERTS) bundled with the release /will/ be incompatible with the
target system.

When the OTP application is started, an obscure linking error will be emitted
complaining about how ERTS cannot find a ~ncurses.so.6~ file and promptly fail.

Worse, after possibly "fixing" this issue, ~ncurses~ is only one of a few
shared objects Erlang needs to run, depending on what was enabled when Erlang
was built or what features the deployed application needs.

