blog/2016/05/elixir-otp-releases/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-05-25 Wed 15:08 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Releasing Elixir/OTP applications to the World</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="kb" />
<meta name="description" content="The perils of releasing OTP applications in the wild"
 />
<meta charset="utf-8">

<meta name="author" content="Kenny Ballou">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

<title>~kb</title>

<link rel="canonical" href="/" />
<link href="/index.xml" rel="alternate" type="application/rss+xml"
      title="~kb/blog" />

<link rel="stylesheet" href="/css/simple.css" />
<link rel="stylesheet" href="/css/simple.add.css" />
<link rel="stylesheet" href="/css/katex.css" />
<link rel="stylesheet" href="/css/fa-all.css" />
<link rel="shortcut icon" href="/favicon.ico" type="image/x-icon" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://kennyballou.com/blog"> UP </a>
 |
 <a accesskey="H" href="https://kennyballou.com/"> HOME </a>
</div><header id="" class="status">
<nav>
  <a href="/about.html">
    <i class="fade fas fa-user-circle"></i>
  </a>
  <a href="https://git.devnulllabs.io"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fas fa-code-branch fa-1x"></i>
  </a>
  <a href="https://github.com/kennyballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-github fa-1x"></i>
  </a>
  <a href="https://bitbucket.org/kballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-bitbucket fa-1x"></i>
  </a>
  <a href="https://twitter.com/kennyballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-twitter fa-1x"></i>
  </a>
  <a href="https://www.buymeacoffee.com/kennyballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fas fa-mug-hot fa-1x"></i>
  </a>
  <a href="/resume.pdf"
     target="_blank">
    <i class="fade far fa-file-pdf"></i>
  </a>
  <a href="/932F3E8E1C0F4A9895D7B8B8B0CAA28A02958308.txt"
     target="_blank">
    <i class="fade fas fa-key"></i>
  </a>
  <a href="/index.xml" rel="alternate"
     type="application/rss+xml">
    <i class="fade fas fa-rss fa-1x"></i>
  </a>
</nav>
</header>
<div id="main">
<h1 class="title">Releasing Elixir/OTP applications to the World</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgcaf72bc">Problem</a>
<ul>
<li><a href="#orgd60157c">Shared Objects</a></li>
<li><a href="#orgfe9fcd8">Erlang Libraries</a></li>
<li><a href="#orgded0248">Docker or Virtualization</a></li>
<li><a href="#org5113bfc">OTP as Project Dependency</a></li>
</ul>
</li>
<li><a href="#org6f7cc74">Non-Solution Solutions</a></li>
<li><a href="#orgaf96f8e">Solutions(?)</a></li>
<li><a href="#org7a1b134">Moving Forward</a></li>
</ul>
</div>
</div>
<div class="PREVIEW">
<p>
Developing Elixir/OTP applications is an enlightening, mind-boggling, and
ultimately enjoyable experience.  There are so many features of the language
that change the very way we as developers think about concurrency and program
structure.  From writing pure functional code, to using message passing to
coordinate complex systems, it is one of the best languages for the SMP
revolution that has been slowly boiling under our feet.
</p>

</div>

<p>
However, <i>releasing</i> Elixir and OTP applications is an entirely different and
seemingly seldom discussed topic.
</p>

<p>
The distribution tool chain of Erlang and OTP is a complicated one, There's
<a href="http://erlang.org/doc/man/systools.html"><code>systools</code></a>, <a href="http://erlang.org/doc/man/reltool.html"><code>reltool</code></a>,
<a href="https://github.com/erlang/rebar3/releases"><code>rebar(?3)</code></a>, and <a href="https://github.com/erlware/relx"><code>relx</code></a> just to name a few that all
ultimately help in creating an Erlang/OTP <a href="http://erlang.org/doc/design_principles/release_structure.html">"release"</a>.
Similar to <code>rebar3</code>, <a href="https://github.com/bitwalker/exrm"><code>exrm</code></a> takes the high-level abstraction approach
to combining <code>reltool</code> and <code>relx</code> into a single tool chain for creating
releases of Elixir projects.  Of course, we can also borrow from the collection
of <a href="https://en.wikipedia.org/wiki/GNU_Build_System">autotools</a>.
</p>

<p>
There are plenty of articles and posts discussing how and why to use <code>exrm</code>.  I
feel many of them, however, fail to <i>truly</i> discuss <i>how</i> to do this
effectively.  Most will mention the surface of the issue, but never give the
issue any real attention.  As any developer that wants to eventually <i>ship</i>
code, this is entirely too frustrating to leave alone.
</p>

<p>
There are "ways" of deploying OTP code relatively simply, however, these
methods generally avoid good practice of continuous integration/continuous
deployment, e.g., "build the OTP application <i>on</i> the target system" or simply
use <code>mix run</code>, etc.
</p>

<p>
I cannot speak for everyone, but my general goal is to <i>not</i> have such a manual
step in my release pipeline, let alone having a possibly full autotool chain
and Erlang/Elixir stack on the production system is slightly unnerving for it's
own set of reasons.
</p>

<div id="outline-container-orgcaf72bc" class="outline-2">
<h2 id="orgcaf72bc"><a id="ID-a5bb175a-373c-45ee-b686-1a6fd9254859"></a>Problem</h2>
<div class="outline-text-2" id="text-orgcaf72bc">
<p>
Here are some selected quotes; I'm not trying to pick on anyone in particular
or the community at large, but I'm trying to show a representation of why this
very topic is an issue in the first place.
</p>

<blockquote>
<p>
We need to be sure that the architectures for both our build and hosting
environments are the same, e.g. 64-bit Linux -&gt; 64-bit Linux.  If the
architectures don't match, our application might not run when deployed.
Using a virtual machine that mirrors our hosting environment as our build
environment is an easy way to avoid that problem.
<a href="http://www.phoenixframework.org/docs/advanced-deployment">Phoenix Exrm Releases</a>.
</p>
</blockquote>

<p>
And another, similar quote:
</p>

<blockquote>
<p>
One important thing to note, however: <i>you must use the same architecture for
building your release that the release is getting deployed to.</i> If your
development machine is OS X and you're deploying to a Linux server, you need
a Linux machine to build your exrm release or it isn't going to work, or you
can just build on the same server you're going to be running everything on.
<a href="https://erlang-solutions.com">Brandon Richey</a>.
</p>
</blockquote>

<p>
Unfortunately, these miss a lot of the more subtle issues, dependency hell is
real, and we're about to really dive into it.
</p>

<p>
There are a few examples where "same architecture" isn't enough, and this is
where we will spend the majority of our time.
</p>

<p>
For these examples, we will assume our host machine is running GNU/Linux,
specifically Arch Linux, and our target machine is running CentOS 7.2.  Both
machines are running the <code>AMD64</code> instruction sets, the architectures are the
<i>same</i>.
</p>
</div>

<div id="outline-container-orgd60157c" class="outline-3">
<h3 id="orgd60157c"><a id="ID-93561071-f3ac-4bbc-a24d-4977bd78a317"></a>Shared Objects</h3>
<div class="outline-text-3" id="text-orgd60157c">
<p>
Let's start with the most simplistic issue, different versions of shared
objects.
</p>

<p>
Arch Linux is a rolling release distribution that is generally <i>right</i> on the
bleeding edge of packages, upstream is usually the development sources
themselves.  When <code>ncurses</code> moves version 6, Arch isn't far behind in putting
it in the stable package repository (and rebuilding a number of packages that
depend on <code>ncurses</code>).  CentOS, on the other hand, is not so aggressive.
Therefore, when using the default <code>relx</code> configuration with <code>exrm</code>, the Erlang
runtime system (ERTS) bundled with the release <i>will</i> be incompatible with the
target system.
</p>

<p>
When the OTP application is started, an obscure linking error will be emitted
complaining about how ERTS cannot find a <code>ncurses.so.6</code> file and promptly fail.
</p>

<p>
Worse, after possibly "fixing" this issue, <code>ncurses</code> is only one of a few
shared objects Erlang needs to run, depending on what was enabled when Erlang
was built or what features the deployed application needs.
</p>
</div>
</div>
