posts/elixir-otp-releases.org
*** Erlang Libraries
:PROPERTIES:
:ID:       46a3fda1-6ecd-428d-9354-97561f9a0dbb
:END:

We may try to resolve this issue by adding a particular ~rel/relx.config~ file
to our Elixir project.  Specifically, we will /not/ bundle ERTS, opting to use
the target's ERTS instead.

#+BEGIN_EXAMPLE erlang
    {include_erts, false}.
#+END_EXAMPLE

This seems like a promising approach, until another error message is emitted at
startup, namely, ERTS cannot find ~stdlib-2.8~ in the ~/usr/lib/erlang/lib~
folder.

Did I mention that our current build system is Arch and our target is CentOS?
Arch may have the /newest/ version of Erlang in the repository and CentOS is
still at whatever it was at before: R16B unless the
[[erlang-solutions-homepage][Erlang Solutions]] release is being used.

Since Erlang applications do (patch number) version locking, applications in
the dependency tree will need to match exactly and it's guaranteed that any and
all OTP applications will be at least depending on the Erlang kernel and the
Erlang standard library, these are at least two OTP applications /our/
application is going to need that are /no longer packaged when ~relx~ doesn't
bundle ERTS/.

Even if we specify another option to ~relx~, namely, ~{system_libs, true}.~, we
are left with the same lack of Erlang system libraries.

That's correct and there is some sensible reasons for this.  If we ask ~exrm~
and therefore ~relx~ to not include the build system's ERTS, we are /also/
excluding the standard Erlang libraries from the release as well, asking to
include the standard libraries of the build system's ERTS could run into the
/very/ same issues as above for a whole host of other reasons.

We are left to attempt more solutions.

*** Docker or Virtualization
:PROPERTIES:
:ID:       12db9648-3a15-4deb-b367-8f276f2bf1f6
:END:

Next, since we do want to ultimately get our build running in a CI/CD
environment, we may look toward virutalization/containerization.  Being
sensible people, we try to use a small image, maybe basing our image on
[[alpine-linux][Alpine Linux]] as to be nice to our precious ~/var~ or SSD
space.  We may even go so far as to build Erlang and Elixir ourselves in these
images to make sure we have the most control over them as we can.  Furthermore,
since we are building everything ourself, shipping the built ERTS seems like a
good idea too, so we can delete the ~rel/relx.config~ file.

This seems promising.  However, we have shared object problems again.  Since we
are building Erlang and Elixir ourselves, we decided to disable ~termcap~
support thus no longer requiring the ~ncurses~ library altogether.  We hope
that the ~openssl~ libraries are the same, so we don't have to worry about that
mess, and we move on.

This time, when we attempt to deploy the application, we get a different,
obscure error: something about our ~musl~ C library isn't found on the target
system.  Right, because we are trying to create a small image, we opted to use
the ~musl~ C library because of its size and being easily supported in the
Alpine Linux container.  Trying to use GNU C library is too cumbersome and
would only inflate the image beyond any gains we would achieve by using Alpine
in the first place.

That's not going to work.

*** OTP as Project Dependency
:PROPERTIES:
:ID:       5a4802cf-76c3-4794-8616-b6a897386daf
:END:

Another option we might try is make Erlang a build dependency of our Elixir
application, this /could/ be achieved via the following structure:

#+BEGIN_EXAMPLE elixir
    {:otp,
     "~> 18.3.2",
     github: "erlang/otp",
     tag: "OTP-18.3.2",
     only: :prod,
     compile: "./otp_build autoconf;" <>
              "./configure --without-termcap --without-javac;" <>
              "make -j4" <>
              "DISTDIR=/tmp/erlang make install"
    }
#+END_EXAMPLE

Then using ~rel/relx.config~ with:

#+BEGIN_EXAMPLE erlang
    {include_erts, "/tmp/erlang"}.
#+END_EXAMPLE

/May/ turn out to work, assuming the build server and the target system have
the same shared objects for OpenSSL and others that may be enabled by default.

#+BEGIN_QUOTE
However, I didn't follow this idea all the way to the end as I wasn't
entirely happy with it, and it would fall to some later issues.
#+END_QUOTE

Notably, though, this will inflate the production builds drastically since our
~mix deps.get~ and ~mix deps.compile~ steps will hang attempting to build
Erlang itself.

However, again, we will likely run into issues with the C library used by the
build system/container.  Going this route doesn't allow us to use Alpine Linux
either.

Worse, there's another issue that hasn't even shown itself but is lying in
wait: native implemented (or interface) functions (NIFs).

If our project has a dependency that builds a NIF as part of its build
(Elixir's [[hex-comeonin][comeonin]] is a good example of this), unless the NIF
is statically compiled, we are back to square one and shared objects are not
our friends.  Furthermore, if we are using a different standard library
implementation, i.e., ~musl~ vs ~glibc~, the dependency will likely complain
about it as well.

** Non-Solution Solutions
:PROPERTIES:
:ID:       36bda176-eb6a-412b-b7a8-2102e4cbcd36
:END:

Of course, all of these above issues can be solved by "just building on the
target machine" or by simply using ~mix run~ on the target instead.  However, I
personally find these solutions unacceptable.

I'm not overly fond of requiring my target hosts, my production machines,
running a full development tool chain.  Before this is dismissed as a personal
issue, remember that our dependency tree may contain NIFs outside of our
control.  Therefore, it's not just Erlang/Elixir that are required to be on the
machine, but a C standard library and autotools too.

This solution doesn't immediately give the impression of scaling architecture.
If a new release needs to be deployed, each server will now need to spare some
load for building the project and its dependencies before any real, actual
upgrading can continue.

