blog/2016/05/elixir-otp-releases/index.html

<div id="outline-container-orgfe9fcd8" class="outline-3">
<h3 id="orgfe9fcd8"><a id="ID-46a3fda1-6ecd-428d-9354-97561f9a0dbb"></a>Erlang Libraries</h3>
<div class="outline-text-3" id="text-orgfe9fcd8">
<p>
We may try to resolve this issue by adding a particular <code>rel/relx.config</code> file
to our Elixir project.  Specifically, we will <i>not</i> bundle ERTS, opting to use
the target's ERTS instead.
</p>

<pre class="example">
{include_erts, false}.
</pre>

<p>
This seems like a promising approach, until another error message is emitted at
startup, namely, ERTS cannot find <code>stdlib-2.8</code> in the <code>/usr/lib/erlang/lib</code>
folder.
</p>

<p>
Did I mention that our current build system is Arch and our target is CentOS?
Arch may have the <i>newest</i> version of Erlang in the repository and CentOS is
still at whatever it was at before: R16B unless the
<a href="https://erlang-solutions.com">Erlang Solutions</a> release is being used.
</p>

<p>
Since Erlang applications do (patch number) version locking, applications in
the dependency tree will need to match exactly and it's guaranteed that any and
all OTP applications will be at least depending on the Erlang kernel and the
Erlang standard library, these are at least two OTP applications <i>our</i>
application is going to need that are <i>no longer packaged when <code>relx</code> doesn't
bundle ERTS</i>.
</p>

<p>
Even if we specify another option to <code>relx</code>, namely, <code>{system_libs, true}.</code>, we
are left with the same lack of Erlang system libraries.
</p>

<p>
That's correct and there is some sensible reasons for this.  If we ask <code>exrm</code>
and therefore <code>relx</code> to not include the build system's ERTS, we are <i>also</i>
excluding the standard Erlang libraries from the release as well, asking to
include the standard libraries of the build system's ERTS could run into the
<i>very</i> same issues as above for a whole host of other reasons.
</p>

<p>
We are left to attempt more solutions.
</p>
</div>
</div>

<div id="outline-container-orgded0248" class="outline-3">
<h3 id="orgded0248"><a id="ID-12db9648-3a15-4deb-b367-8f276f2bf1f6"></a>Docker or Virtualization</h3>
<div class="outline-text-3" id="text-orgded0248">
<p>
Next, since we do want to ultimately get our build running in a CI/CD
environment, we may look toward virutalization/containerization.  Being
sensible people, we try to use a small image, maybe basing our image on
<a href="http://alpinelinux.org">Alpine Linux</a> as to be nice to our precious <code>/var</code> or SSD
space.  We may even go so far as to build Erlang and Elixir ourselves in these
images to make sure we have the most control over them as we can.  Furthermore,
since we are building everything ourself, shipping the built ERTS seems like a
good idea too, so we can delete the <code>rel/relx.config</code> file.
</p>

<p>
This seems promising.  However, we have shared object problems again.  Since we
are building Erlang and Elixir ourselves, we decided to disable <code>termcap</code>
support thus no longer requiring the <code>ncurses</code> library altogether.  We hope
that the <code>openssl</code> libraries are the same, so we don't have to worry about that
mess, and we move on.
</p>

<p>
This time, when we attempt to deploy the application, we get a different,
obscure error: something about our <code>musl</code> C library isn't found on the target
system.  Right, because we are trying to create a small image, we opted to use
the <code>musl</code> C library because of its size and being easily supported in the
Alpine Linux container.  Trying to use GNU C library is too cumbersome and
would only inflate the image beyond any gains we would achieve by using Alpine
in the first place.
</p>

<p>
That's not going to work.
</p>
</div>
</div>

<div id="outline-container-org5113bfc" class="outline-3">
<h3 id="org5113bfc"><a id="ID-5a4802cf-76c3-4794-8616-b6a897386daf"></a>OTP as Project Dependency</h3>
<div class="outline-text-3" id="text-org5113bfc">
<p>
Another option we might try is make Erlang a build dependency of our Elixir
application, this <i>could</i> be achieved via the following structure:
</p>

<pre class="example">
{:otp,
 "~&gt; 18.3.2",
 github: "erlang/otp",
 tag: "OTP-18.3.2",
 only: :prod,
 compile: "./otp_build autoconf;" &lt;&gt;
          "./configure --without-termcap --without-javac;" &lt;&gt;
          "make -j4" &lt;&gt;
          "DISTDIR=/tmp/erlang make install"
}
</pre>

<p>
Then using <code>rel/relx.config</code> with:
</p>

<pre class="example">
{include_erts, "/tmp/erlang"}.
</pre>

<p>
<i>May</i> turn out to work, assuming the build server and the target system have
the same shared objects for OpenSSL and others that may be enabled by default.
</p>

<blockquote>
<p>
However, I didn't follow this idea all the way to the end as I wasn't
entirely happy with it, and it would fall to some later issues.
</p>
</blockquote>

<p>
Notably, though, this will inflate the production builds drastically since our
<code>mix deps.get</code> and <code>mix deps.compile</code> steps will hang attempting to build
Erlang itself.
</p>

<p>
However, again, we will likely run into issues with the C library used by the
build system/container.  Going this route doesn't allow us to use Alpine Linux
either.
</p>

<p>
Worse, there's another issue that hasn't even shown itself but is lying in
wait: native implemented (or interface) functions (NIFs).
</p>

<p>
If our project has a dependency that builds a NIF as part of its build
(Elixir's <a href="https://hex.pm/packages/comeonin">comeonin</a> is a good example of this), unless the NIF
is statically compiled, we are back to square one and shared objects are not
our friends.  Furthermore, if we are using a different standard library
implementation, i.e., <code>musl</code> vs <code>glibc</code>, the dependency will likely complain
about it as well.
</p>
</div>
</div>
</div>

<div id="outline-container-org6f7cc74" class="outline-2">
<h2 id="org6f7cc74"><a id="ID-36bda176-eb6a-412b-b7a8-2102e4cbcd36"></a>Non-Solution Solutions</h2>
<div class="outline-text-2" id="text-org6f7cc74">
<p>
Of course, all of these above issues can be solved by "just building on the
target machine" or by simply using <code>mix run</code> on the target instead.  However, I
personally find these solutions unacceptable.
</p>

<p>
I'm not overly fond of requiring my target hosts, my production machines,
running a full development tool chain.  Before this is dismissed as a personal
issue, remember that our dependency tree may contain NIFs outside of our
control.  Therefore, it's not just Erlang/Elixir that are required to be on the
machine, but a C standard library and autotools too.
</p>

<p>
This solution doesn't immediately give the impression of scaling architecture.
If a new release needs to be deployed, each server will now need to spare some
load for building the project and its dependencies before any real, actual
upgrading can continue.
</p>
</div>
</div>
