posts/elixir-otp-releases.org
** Solutions(?)
:PROPERTIES:
:ID:       d1fa6111-c61b-4dea-890d-6736dbe20fb7
:END:

What are we to do? How are we to build Erlang/Elixir/OTP applications as part
of our CI/CD pipeline? Particularly, how are we to build our applications on a
CI/CD system and /not/ the production box(es) themselves?

If any of the above problems tell us anything, it's that the build system must
be either the /exact same/ machine or clone with build tools.  Thankfully, we
can achieve a "clone" without too much work using [[docker][Docker]] and the
[[docker-hub][official image registries]].

By using the official CentOS image and a specific tag, we can match our target
system almost exactly.  Furthermore, building the Erlang/Elixir stack from
source is a relatively small order for a Docker container too, making
versioning completely within reach.  Moreover, since the build host and the
target host are nearly identical, bundling ERTS should be a non-issue.

#+BEGIN_QUOTE
This is the observed result of using
[[kb-docker-elixir-centos][docker-elixir-centos]] for a base image for CI
builds.
#+END_QUOTE

Another possible solution is to ship Docker containers as the artifact of the
build.  However, this, to do well, requires a decent Docker capable
infrastructure and deployment process.  Furthermore, going this route, it's
unlikely that ~exrm~ is even necessary at all.  It is likely more appropriate
to simply use ~mix run~ or whatever the project's equivalent is.  Another thing
lost here, is [[erlang-docs-reltool][relups]], which is essentially the whole
reason of wanting to use ~exrm~ in the first place.

As such, if using ~exrm~ is desired, setting up a build server will be
imperative to building reliably and without building on production.  Scaling
from a solid build foundation will be much easier than building and "deploying"
on the production farm itself.

** Moving Forward
:PROPERTIES:
:ID:       c863c3c8-9535-4309-9961-b87d44213b98
:END:

Releasing software isn't in a particularly hard class of problems, but it does
have its challenges.  Some languages attempt to solve this challenge in its
artifact/build result.  Other languages, unfortunately, don't attempt to solve
this problem at all.  Though, I can see it possible to eventually reach a goal
of being able to create binary releases with steps as simple as ~./configure &&
make && make install && tar~.

But we aren't there yet.

But we are close.

The current way Erlang/OTP applications want to be deployed includes wanting to
ship /with/ the runtime, this is a great starting point.

To move to a better, easier release cycle, we need a few things:

- The ability to (natively) cross-compile to different architectures and
  different versions of ERTS /and/ cross-compile Erlang code itself.

- The ability to easily statically compile ERTS and bundle the result for the
  specified architecture.

Cross-compiling to different versions of ERTS is likely a harder problem to
tackle.  But being able to cross-compile the ERTS itself is likely much easier
since this is already a [[gnu-automake-crosscompile][feature]] of GCC.

Thus, our problem is now how do we add and/or expose the facility of
customizing the appropriate build flags to our projects and dependencies to
cross-compile a static ERTS and any NIFs and bundle these into a solid OTP
release.
