blog/2016/05/elixir-otp-releases/index.html

<div id="outline-container-orgaf96f8e" class="outline-2">
<h2 id="orgaf96f8e"><a id="ID-d1fa6111-c61b-4dea-890d-6736dbe20fb7"></a>Solutions(?)</h2>
<div class="outline-text-2" id="text-orgaf96f8e">
<p>
What are we to do? How are we to build Erlang/Elixir/OTP applications as part
of our CI/CD pipeline? Particularly, how are we to build our applications on a
CI/CD system and <i>not</i> the production box(es) themselves?
</p>

<p>
If any of the above problems tell us anything, it's that the build system must
be either the <i>exact same</i> machine or clone with build tools.  Thankfully, we
can achieve a "clone" without too much work using <a href="https://docker.com">Docker</a> and the
<a href="https://hub.docker.com/explore/">official image registries</a>.
</p>

<p>
By using the official CentOS image and a specific tag, we can match our target
system almost exactly.  Furthermore, building the Erlang/Elixir stack from
source is a relatively small order for a Docker container too, making
versioning completely within reach.  Moreover, since the build host and the
target host are nearly identical, bundling ERTS should be a non-issue.
</p>

<blockquote>
<p>
This is the observed result of using
<a href="https://github.com/kennyballou/docker-elixir-centos">docker-elixir-centos</a> for a base image for CI
builds.
</p>
</blockquote>

<p>
Another possible solution is to ship Docker containers as the artifact of the
build.  However, this, to do well, requires a decent Docker capable
infrastructure and deployment process.  Furthermore, going this route, it's
unlikely that <code>exrm</code> is even necessary at all.  It is likely more appropriate
to simply use <code>mix run</code> or whatever the project's equivalent is.  Another thing
lost here, is <a href="http://erlang.org/doc/man/reltool.html">relups</a>, which is essentially the whole
reason of wanting to use <code>exrm</code> in the first place.
</p>

<p>
As such, if using <code>exrm</code> is desired, setting up a build server will be
imperative to building reliably and without building on production.  Scaling
from a solid build foundation will be much easier than building and "deploying"
on the production farm itself.
</p>
</div>
</div>

<div id="outline-container-org7a1b134" class="outline-2">
<h2 id="org7a1b134"><a id="ID-c863c3c8-9535-4309-9961-b87d44213b98"></a>Moving Forward</h2>
<div class="outline-text-2" id="text-org7a1b134">
<p>
Releasing software isn't in a particularly hard class of problems, but it does
have its challenges.  Some languages attempt to solve this challenge in its
artifact/build result.  Other languages, unfortunately, don't attempt to solve
this problem at all.  Though, I can see it possible to eventually reach a goal
of being able to create binary releases with steps as simple as <code>./configure &amp;&amp;
make &amp;&amp; make install &amp;&amp; tar</code>.
</p>

<p>
But we aren't there yet.
</p>

<p>
But we are close.
</p>

<p>
The current way Erlang/OTP applications want to be deployed includes wanting to
ship <i>with</i> the runtime, this is a great starting point.
</p>

<p>
To move to a better, easier release cycle, we need a few things:
</p>

<ul class="org-ul">
<li>The ability to (natively) cross-compile to different architectures and
different versions of ERTS <i>and</i> cross-compile Erlang code itself.</li>

<li>The ability to easily statically compile ERTS and bundle the result for the
specified architecture.</li>
</ul>

<p>
Cross-compiling to different versions of ERTS is likely a harder problem to
tackle.  But being able to cross-compile the ERTS itself is likely much easier
since this is already a <a href="https://www.gnu.org/software/automake/manual/html_node/Cross_002dCompilation">feature</a> of GCC.
</p>

<p>
Thus, our problem is now how do we add and/or expose the facility of
customizing the appropriate build flags to our projects and dependencies to
cross-compile a static ERTS and any NIFs and bundle these into a solid OTP
release.
</p>
</div>
</div>
</div>
<footer id="" class="status">
<footer>
  <p>&copy; 2014-2022 Kenny Ballou.
    <a href="http://creativecommons.org/licenses/by-nc-sa/4.0/">Some rights
      reserved.</a></p>
  <p>Powered by <a href="https://gnu.org">GNU/Linux</a></p>
</footer>
</footer>
</body>
</html>
